Subject: Сообщение в теме: <topic_subject>

Не отвечайте на это сообщение, оно послано роботом!

<replier> написал ответ в теме <topic_subject>, на которую Вы, в своё время, подписались на форуме. В этой теме может быть несколько ответов, это письмо является лишь уведомлением о том, что, с момента Вашего последнего визита на форум, в этой теме появились новые сообщения.

Содержание сообщения:
-----------------------------------------------------------------------

<message>

-----------------------------------------------------------------------

Сообщение можно прочитать по адресу <post_url>

Вы не будете получать на почту новых сообщений в этой теме, пока не зайдёте в неё снова.

Вы можете отписаться от получения уведомлений по адресу <unsubscribe_url>

--
<board_mailer>
