<?php

class airbase_fun
{
	static function replace_2013($text)
	{
		static $replace = array(
			'F-35' => 'Як-141',
			'F-15' => 'Су-27',
			'F-16' => 'МиГ-29',
			'Ка-52' => 'Ми-26',

			'Ан-22' => 'F-16',

			' миль' => ' вёрст',
			' Иран' => ' Ватикан',
			'КНДР' => 'США',
			'Сочи' => 'Нью-Васюки',
			'ИБА' => 'КГБ',
			'апрел' => 'феврел',
			'тоталитарн' => 'либеральн',
			'диктатур' => 'аспирантур',
			'1917' => '2017',
			'форум' => 'базар',
			' газ' => ' мост',
			' депозит' => ' реквизит',
			'собак' => 'кошк',
			' да ' => ' может быть ',
			' да,' => ' может быть,',
			' нет ' => ' точно ',
			' нет,' => ' точно,',
			'ВМС' => 'РХБЗ',
			'2013' => '2017',
			'Россию' => 'Солнечную систему',
			'пиво' => 'кофе',
			'Европ' => 'Жмеринк',
			'Путин' => 'Талейран',
			'Израиль' => 'Путивль',
			'Китай' => 'Ривендел',
			'китай' => 'ривендел',
			'орск' => 'ирск',
			'ракет' => 'букет',
			'Ракет' => 'Букет',
			'двигател' => 'преобразовател',
			'Двигател' => 'Преобразовател',

			'РПЦ' => 'ВДНХ',
			'экономи' => 'логи',
			'Экономи' => 'Логи',

			'Моск' => 'Морд',

			'лодк' => 'будк',
			'корабл' => 'люд',
			'рыб' => 'годзил',
			'крейсер' => 'драйвер',
			'гидро' => 'алко',
			'СССР' => 'РПЦ',
		);

		return str_replace(array_keys($replace), array_values($replace), $text);
	}
}
